TECHNICAL.org
#+TITLE: Internals and literate programming setup
#+LANGUAGE: en

This file documents the internals of daggerlib: the literate
programming setup, tangling pipeline, and editor configuration. See
[[file:readme.org][readme.org]] for an introduction.

* Module entry point
  :PROPERTIES:
  :ID:       48120ecb-7e3c-4cdb-8856-8304b784e40e
  :END:

  The =__init__.py= simply re-exports the =Lib= class:

  #+begin_src python :tangle src/lib/__init__.py
  """Reusable container helpers: base images, timezone, user setup, DinD, etc."""

  from .main import Lib as Lib
  #+end_src

  The =main.py= defines the =@object_type= class that composes all the
  functions defined in the use-case org files. Besides image versions,
  the class carries a =default_username= field so the container user
  is defined once and overridable globally — individual functions
  default to =None= and fall back to =self.default_username=. The
  =timezone= field (default =Europe/Paris=) controls which timezone is
  set in all container variants.

  #+begin_src python :tangle src/lib/main.py
  """Reusable container helpers: base images, timezone, user setup, DinD, etc."""

  from dagger import function, object_type

  from .dev import Dev
  from .alpine import (
      alpine,
      alpine_python,
      alpine_python_user_venv,
      alpine_set_tz,
      alpine_tz,
      alpine_user,
  )
  from .debian import (
      debian,
      debian_apt_cleanup,
      debian_localtime,
      debian_no_auto_install,
      debian_python_user_venv,
      debian_set_tz,
      debian_user,
  )
  from .python import python_user_venv, python_venv
  from .dind import dind_container, dind_with_docker
  from .distroless import distroless_debian, distroless_python3_debian, distroless_set_tz
  from .flask_venv import flask_venv
  from .pip_tools import pip_tools
  from .ralph import ralph
  from .user import as_user, setup_user, use_user


  @object_type
  class Lib:
      alpine_version: str = "3.23"
      debian_version: str = "13"
      debian_min_version: str = "2"
      pip_tools_python_version: str = "3.12"
      default_username: str = "sam"
      timezone: str = "Europe/Paris"
      dev_debian_image: str = "debian:bookworm-slim"
      dind_ubuntu_image: str = "ubuntu:24.04"

      # Alpine
      alpine_set_tz = alpine_set_tz
      alpine = alpine
      alpine_user = alpine_user
      alpine_tz = alpine_tz
      alpine_python = alpine_python
      alpine_python_user_venv = alpine_python_user_venv

      # Debian
      @property
      def debian_tag(self) -> str:
          return f"{self.debian_version}.{self.debian_min_version}-slim"

      debian_no_auto_install = debian_no_auto_install
      debian_set_tz = debian_set_tz
      debian_apt_cleanup = debian_apt_cleanup
      debian = debian
      debian_user = debian_user
      debian_python_user_venv = debian_python_user_venv
      debian_localtime = debian_localtime

      # Python
      python_venv = python_venv
      python_user_venv = python_user_venv

      # Distroless
      distroless_set_tz = distroless_set_tz
      distroless_python3_debian = distroless_python3_debian
      distroless_debian = distroless_debian

      # User
      setup_user = setup_user
      as_user = as_user
      use_user = use_user


      # Pip tools
      pip_tools = pip_tools

      # Flask
      flask_venv = flask_venv

      # DinD
      dind_container = dind_container
      dind_with_docker = dind_with_docker

      # Ralph
      ralph = ralph

      @function
      def dev(self) -> Dev:
          """Development tooling: tangle, test, and run inside containers."""
          return Dev(debian_image=self.dev_debian_image)
  #+end_src

* Editor configuration
  :PROPERTIES:
  :ID:       d36cf7bf-faac-46a9-9150-4031c8f06ca6
  :END:

  The =.dir-locals.el= ensures that Emacs preserves Python indentation
  inside org code blocks. Without this, =C-c '= (org-edit-special) would
  re-indent Python code relative to the org heading level.

  #+begin_src emacs-lisp :tangle .dir-locals.el
    ((org-mode
      . ((org-babel-default-header-args:python
          . ((:preserve-indentation . t)))
         (org-id-link-to-org-use-id . nil)
         (eval . (load (expand-file-name "reproducibility-helpers.el"
                         (locate-dominating-file default-directory ".dir-locals.el"))
                       t)))))
  #+end_src

* Development

  The org files are the source of truth. The Python modules, test scripts,
  and =tangle.sh= itself are all generated. To regenerate everything from
  scratch:

  #+begin_src bash
  rm -rf src/lib/alpine.py src/lib/debian.py src/lib/dind.py \
         src/lib/distroless.py src/lib/flask_venv.py src/lib/pip_tools.py \
         src/lib/user.py src/lib/main.py src/lib/__init__.py \
         tests/*.sh tests/test_use_cases.py \
         tangle.sh tangle.el test.sh
  dagger develop
  ./tangle.sh
  #+end_src

* Reproducibility helpers

  Helpers loaded both by =tangle.el= (batch) and =.dir-locals.el=
  (interactive), so tangling works the same way everywhere.

  The ruff post-tangle hook ensures that Python files are formatted
  identically whether tangled from the command line or interactively.

  The =fixtureyaml= org-babel language generates CLI bash blocks,
  evaluates them, and writes test fixtures (spec + expected value)
  to =tests/specs/= and =tests/expected/=.


  #+begin_src emacs-lisp :tangle reproducibility-helpers.el
  ;;; reproducibility-helpers.el --- Post-tangle hooks and fixtureyaml language

  (defun daggerlib-ruff-format-after-tangle ()
    "Run ruff format on the current buffer if it is a Python file."
    (when (string-match-p "\\.py\\'" (buffer-file-name))
      (shell-command (format "ruff format --quiet '%s'" (buffer-file-name)))
      (revert-buffer t t t)))

  (add-hook 'org-babel-post-tangle-hook #'daggerlib-ruff-format-after-tangle :append)

  (defun fixtureyaml--spec-to-cli (yaml-body root)
    "Convert YAML spec body to a dagger call CLI string via generate_tests.py."
    (let ((script (expand-file-name "tests/generate_tests.py" root)))
      (string-trim
       (shell-command-to-string
        (format "echo %s | python3 %s"
                (shell-quote-argument yaml-body)
                (shell-quote-argument script))))))

  (defun fixtureyaml--execute-cli (cli root)
    "Execute a CLI command in ROOT directory, return stdout.
  Sets up TMP and ROOT environment variables for export/post commands.
  Stderr is captured and shown in case of error."
    (let* ((stderr-file (make-temp-file "fixtureyaml-stderr"))
           (tmp-dir (make-temp-file "fixtureyaml-tmp" t))
           (env-setup (format "export TMP=%s ROOT=%s PATH=%s/tests:$PATH"
                              (shell-quote-argument tmp-dir)
                              (shell-quote-argument root)
                              (shell-quote-argument root))))
      (unwind-protect
          (let ((result (string-trim
                         (shell-command-to-string
                          (format "cd %s && %s && { %s ; } 2>%s"
                                  (shell-quote-argument root)
                                  env-setup
                                  cli
                                  (shell-quote-argument stderr-file))))))
            (when (and (string-empty-p result)
                       (file-exists-p stderr-file))
              (let ((stderr (string-trim
                             (with-temp-buffer
                               (insert-file-contents stderr-file)
                               (buffer-string)))))
                (unless (string-empty-p stderr)
                  (message "fixtureyaml stderr: %s" stderr))))
            result)
        (delete-file stderr-file)
        (delete-directory tmp-dir t))))

  (defun fixtureyaml--write-fixture (name yaml-body result root)
    "Write spec and expected files for NAME under ROOT/tests/."
    (let ((specs-dir (expand-file-name "tests/specs/" root))
          (expected-dir (expand-file-name "tests/expected/" root)))
      (make-directory specs-dir t)
      (make-directory expected-dir t)
      (let ((spec-file (expand-file-name (concat name ".yml") specs-dir))
            (expected-file (expand-file-name name expected-dir)))
        (with-temp-file spec-file (insert yaml-body))
        (with-temp-file expected-file (insert result)))))

  (defun daggerlib--sha1-hash-strip-dir (orig-fn &optional info context)
    "Advice to strip :dir from params before hashing.
  This makes the cache hash independent of the project's absolute path,
  so hashes computed in a container match those on the host."
    (let* ((info (or info (org-babel-get-src-block-info)))
           (params (nth 2 info))
           (stripped (cl-remove-if (lambda (p) (eq (car p) :dir)) params))
           (patched (copy-sequence info)))
      (setf (nth 2 patched) stripped)
      (funcall orig-fn patched context)))

  (advice-add 'org-babel-sha1-hash :around #'daggerlib--sha1-hash-strip-dir)

  (defun fixtureyaml--bash-cache-hash (cli)
    "Compute the org-babel cache hash for a bash block with body CLI.
  Uses a temp buffer that inherits the current org file's properties."
    (let ((src-buffer (current-buffer))
          (block-text (concat "#+begin_src bash :exports code :eval no-export\n"
                              cli "\n"
                              "#+end_src\n")))
      (with-temp-buffer
        (org-mode)
        (let ((props (with-current-buffer src-buffer
                       (save-excursion
                         (goto-char (point-min))
                         (let (lines)
                           (while (re-search-forward
                                   "^#\\+PROPERTY:.*" nil t)
                             (push (match-string 0) lines))
                           (mapconcat #'identity (nreverse lines) "\n"))))))
          (insert props "\n\n" block-text))
        (org-set-regexps-and-options)
        (goto-char (point-max))
        (re-search-backward "#\\+begin_src bash")
        (org-babel-sha1-hash (org-babel-get-src-block-info)))))

  (defun fixtureyaml--format-output (cli result)
    "Format CLI and RESULT as org markup: a bash src block with cached result."
    (let ((hash (fixtureyaml--bash-cache-hash cli)))
      (concat "#+begin_src bash :exports code :eval no-export\n"
              cli "\n"
              "#+end_src\n"
              "\n"
              "#+RESULTS[" hash "]:\n"
              (mapconcat (lambda (line) (concat ": " line))
                         (split-string result "\n")
                         "\n"))))

  (defun org-babel-execute:fixtureyaml (body params)
    "Execute a fixtureyaml block: generate CLI, run it, write fixtures.
  Returns org markup (bash block + result) for display in a :results drawer."
    (let* ((info (org-babel-get-src-block-info t))
           (name (nth 4 info))
           (root (expand-file-name
                  (locate-dominating-file default-directory "dagger.json")))
           (cli (fixtureyaml--spec-to-cli body root))
           (result (fixtureyaml--execute-cli cli root)))
      (when name
        (fixtureyaml--write-fixture name body result root))
      (fixtureyaml--format-output cli result)))

  ;; :cache yes skips execution when the block hasn't changed.
  ;; :results drawer wraps the output so org can replace it cleanly.
  ;; :exports results shows only the CLI + result on export, hiding the YAML.
  (setq org-babel-default-header-args:fixtureyaml
        '((:cache . "yes")
          (:results . "drawer")
          (:exports . "results")))

  ;;; reproducibility-helpers.el ends here
  #+end_src

* Tangle configuration
  :PROPERTIES:
  :ID:       0474ada9-a621-4c1a-97aa-270cf96e32c4
  :END:

  When =tangle.sh= runs Emacs in batch mode, it loads =tangle.el= to
  configure org-babel before tangling. This ensures that tangled files
  get link comments pointing back to their source block (=:comments yes=)
  and blank lines between blocks (=:padline yes=). It also loads a pinned
  org-mode version from =.tangle-deps/= for reproducibility and registers
  the bash and python babel languages.

  #+begin_src emacs-lisp :tangle tangle.el
  ;;; tangle.el --- Self-contained org-babel tangling for dagger lib -*- lexical-binding: t; -*-

  ;; Don't prompt for code block evaluation
  (setq org-confirm-babel-evaluate nil)

  ;; Load pinned org-mode from .tangle-deps BEFORE anything else loads the
  ;; built-in org.  This must happen before (require 'ob-shell) since that
  ;; transitively loads org.
  (let ((org-lisp-dir
         (expand-file-name ".tangle-deps/org/lisp"
                           (file-name-directory (or load-file-name buffer-file-name)))))
    (when (file-directory-p org-lisp-dir)
      (push org-lisp-dir load-path)
      (let ((contrib (expand-file-name "../contrib/lisp" org-lisp-dir)))
        (when (file-directory-p contrib)
          (push contrib load-path)))
      ;; Force load of pinned org (unload built-in if already loaded)
      (require 'org)))

  ;; Load babel languages needed for tangling
  (require 'ob-shell)
  (require 'ob-python)

  ;; Add link comments and blank lines between blocks in tangled output
  (setq org-babel-default-header-args
        (cons '(:comments . "yes")
              (cons '(:padline . "yes")
                    (assq-delete-all :comments
                      (assq-delete-all :padline
                        org-babel-default-header-args)))))

  ;; Preserve indentation in Python blocks so that org-level indentation
  ;; does not interfere with Python's significant whitespace.
  (add-to-list 'org-babel-default-header-args:python
               '(:preserve-indentation . t))

  ;; Load reproducibility helpers (shared with interactive Emacs
  ;; via .dir-locals.el).
  (load (expand-file-name "reproducibility-helpers.el"
           (file-name-directory (or load-file-name buffer-file-name)))
        t)

  ;;; tangle.el ends here
  #+end_src

* Tangle without dagger (bootstrap)
  :PROPERTIES:
  :ID:       0474c6e4-ce96-4f94-8254-1824581b9f8f
  :END:

  This script tangles the minimum files needed for mode 2 (dagger) to
  work. It uses host tools (emacs, git, ruff) and solves the
  chicken-and-egg problem: dagger functions are tangled Python, so you
  need this script to generate them the first time.

  When called with arguments, it tangles the specified files instead.

  #+begin_src bash :tangle tangle-nodagger.sh :shebang "#!/usr/bin/env bash"
  # Bootstrap tangle using host tools (emacs, git, ruff).
  # Usage:
  #   ./tangle-nodagger.sh                 # tangle only mode 2 bootstrap files
  #   ./tangle-nodagger.sh src/foo.org     # tangle a specific file
  set -eu

  SCRIPT_DIR="$(cd "$(dirname "$0")" && pwd)"

  # Pin org-mode version for reproducible tangle output
  ORG_PIN="1025e3b49a98f175b124dbccd774918360fe7e11"
  ORG_DIR="$SCRIPT_DIR/.tangle-deps/org"
  if [ ! -d "$ORG_DIR" ]; then
      echo "Cloning pinned org-mode ($ORG_PIN)..."
      mkdir -p "$SCRIPT_DIR/.tangle-deps"
      git clone --quiet https://git.savannah.gnu.org/git/emacs/org-mode.git "$ORG_DIR"
      git -C "$ORG_DIR" checkout --quiet "$ORG_PIN"
      # Generate org-loaddefs.el and org-version.el (needed for org to load properly)
      emacs --batch --no-init-file \
          --eval "(progn
                    (push \"$ORG_DIR/lisp\" load-path)
                    (require 'autoload)
                    (setq generated-autoload-file \"$ORG_DIR/lisp/org-loaddefs.el\")
                    (update-directory-autoloads \"$ORG_DIR/lisp\"))" 2>/dev/null
      ORG_GIT_VERSION=$(git -C "$ORG_DIR" describe --tags --match "release_*" 2>/dev/null || echo "N/A")
      ORG_RELEASE=$(echo "$ORG_GIT_VERSION" | sed 's/^release_//;s/-.*//')
      (cd "$ORG_DIR/lisp" && emacs --batch --no-init-file \
          --eval "(progn
                    (push \"$ORG_DIR/lisp\" load-path)
                    (load \"$ORG_DIR/mk/org-fixup.el\")
                    (org-make-org-version \"$ORG_RELEASE\"
                                          \"$ORG_GIT_VERSION\"))") 2>/dev/null || true
  fi

  tangle_file() {
      local orgfile="$1"
      echo "Tangling $orgfile..."
      local tangled_list
      tangled_list=$(emacs --batch --no-init-file \
          -l "$SCRIPT_DIR/tangle.el" \
          --eval "(progn
                    (require 'org)
                    (find-file \"$orgfile\")
                    (let ((files (org-babel-tangle)))
                      (dolist (f files) (princ (format \"%s\n\" f))))
                    (kill-buffer))" 2>&1 | grep -E '^/' || true)
      # Post-process tangled files
      for f in $tangled_list; do
          [ -f "$f" ] || continue
          # Strip trailing whitespace
          sed -i 's/[[:space:]]*$//' "$f"
          # Format Python files
          case "$f" in
              *.py) ruff format --quiet "$f" 2>/dev/null || true ;;
          esac
      done
  }

  if [ $# -eq 0 ]; then
      # Bootstrap only: tangle the files that produce mode 2 infrastructure
      for f in "$SCRIPT_DIR"/TECHNICAL.org "$SCRIPT_DIR"/src/dev.org "$SCRIPT_DIR"/tests/testing.org; do
          [ -f "$f" ] && tangle_file "$f"
      done
  else
      for f in "$@"; do
          tangle_file "$(realpath "$f")"
      done
  fi
  #+end_src

* Tangle script (mode 2)
  :PROPERTIES:
  :ID:       a7c3e1f4-5b2d-4d8e-9f6a-2c1b3e4d5f6a
  :END:

  The daily-use tangle script delegates to dagger. All org files are
  tangled inside the dev container for reproducibility.

  #+begin_src bash :tangle tangle.sh :shebang "#!/usr/bin/env bash"
  set -eu
  cd "$(dirname "$0")"
  exec dagger call dev tangle export --path=.
  #+end_src

* Run configuration
  :PROPERTIES:
  :ID:       0ee81e6f-f3c5-444a-9c36-ea8d777ede25
  :END:

  Like =tangle.el= configures tangling, =run.el= configures batch
  execution of org-babel blocks. It provides =dagger-run-file= to
  execute all named fixtureyaml blocks and save the results. The
  =dagger= wrapper in =tests/= handles suppressing TUI noise (see
  =testing.org=).

  #+begin_src emacs-lisp :tangle run.el
    ;;; run.el --- Batch-execute org-babel fixtureyaml blocks -*- lexical-binding: t; -*-

    (defun dagger-run-file (orgfile)
      "Execute all named fixtureyaml blocks in ORGFILE and save the results."
      (find-file orgfile)
      (org-babel-map-src-blocks nil
        (let ((name (org-element-property :name (org-element-at-point))))
          (when (and name (string= lang "fixtureyaml"))
            (message "%s Executing %s..." (format-time-string "%H:%M:%S") name)
            (org-babel-execute-src-block))))
      (save-buffer)
      (kill-buffer))

    ;;; run.el ends here
  #+end_src

* Run without dagger
  :PROPERTIES:
  :ID:       a7f2c1d8-3e5b-4a9f-b6c2-8d4e1f0a5b3c
  :END:

  Like =tangle-nodagger.sh= runs tangle using host tools,
  =run-nodagger.sh= executes org-babel blocks using emacs in batch
  mode. =Dev.run()= calls this script inside the container — it must
  not delegate back to =dagger call= or it would recurse infinitely.

  #+begin_src bash :tangle run-nodagger.sh :shebang "#!/usr/bin/env bash"
  # Execute org-babel blocks and save results.
  # Usage:
  #   ./run-nodagger.sh                    # run all src and doc org files
  #   ./run-nodagger.sh src/foo.org        # run a specific file
  set -eu

  SCRIPT_DIR="$(cd "$(dirname "$0")" && pwd)"

  run_file() {
      local orgfile="$1"
      echo "Running $orgfile..."
      emacs --batch --no-init-file \
          -l "$SCRIPT_DIR/tangle.el" \
          -l "$SCRIPT_DIR/run.el" \
          --eval "(dagger-run-file \"$orgfile\")" 2>&1 || true
  }

  if [ $# -eq 0 ]; then
      for f in "$SCRIPT_DIR"/src/*.org "$SCRIPT_DIR"/doc/*.org; do
          [ -f "$f" ] && run_file "$f"
      done
  else
      for f in "$@"; do
          run_file "$(realpath "$f")"
      done
  fi
  #+end_src

* Run script (mode 2)
  :PROPERTIES:
  :ID:       b275b2e3-ea23-4ca8-b69a-f7dd4e11d56a
  :END:

  Executes all org-babel blocks inside the dev container and saves
  the results. Populates the =#+RESULTS:= blocks used by
  =check-result= for test verification.

  #+begin_src bash :tangle run.sh :shebang "#!/usr/bin/env bash"
  set -eu
  cd "$(dirname "$0")"
  exec dagger call dev run export --path=.
  #+end_src
